/*
考核作业1：做到从小到大排序数组元素
最后一次修改2023/11/10  20:36
BY:电控组赵英豪
*/

#define _CRT_SECURE_NO_WARNINGS//由于IDE的问题，需要加入此行才可运行，如出现无定义报错请删掉

/************************************↓内容↓***************************************************/



#include <stdio.h>  

void Compare(int A[], int n)//本次比较算法采用了比较经典的冒泡算法
{
    int i, j, temp;
    for (i = 0; i < n - 1; i++)  // 循环控制比较轮数，共需要n-1轮比较
    {
        for (j = 0; j < n - i - 1; j++) // 循环控制每轮比较的次数，每轮比较的元素个数为n-i-1
        {
            if (A[j] > A[j + 1]) // 如果前一个元素大于后一个元素，则交换这两个元素的位置 
            {
                temp = A[j];
                A[j] = A[j + 1];
                A[j + 1] = temp;
            }
        }
    }
}

int main() 
{
    int A[] = { 64, 38, 15, 12, 22, 11, 90 };
    int n = sizeof(A) / sizeof(A[0]);// 计算数组的大小  
    Compare(A, n);
    printf("排序后: \n");
    for (int i = 0; i < n; i++) 
    {
        printf("%d ", A[i]);
    }
    return 0;
}